In [1]:
import csv

In [3]:
f=open("/Users/admin/Movies/test/user.csv","w")

wrt=csv.writer(f)

wrt.writerow(['id','name','age'])
wrt.writerow([101,'Amit',23])
wrt.writerow([102,'Deepak',45])
wrt.writerow([103,'Sam',32])

f.close()

In [4]:
f=open("/Users/admin/Movies/test/user.csv","r")


data=list(csv.reader(f))

data

[['id', 'name', 'age'],
 ['101', 'Amit', '23'],
 ['102', 'Deepak', '45'],
 ['103', 'Sam', '32']]

In [7]:
import pandas as pd

In [8]:
df=pd.read_csv("/Users/admin/Downloads/train.csv")

In [9]:
df.shape

(891, 12)

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [13]:
df.head() #5 row

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [14]:
df['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [15]:
df[['Name','Sex','Age']]

                                                  Name     Sex   Age
0                              Braund, Mr. Owen Harris    male  22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2                               Heikkinen, Miss. Laina  female  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
4                             Allen, Mr. William Henry    male  35.0
..                                                 ...     ...   ...
886                              Montvila, Rev. Juozas    male  27.0
887                       Graham, Miss. Margaret Edith  female  19.0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN
889                              Behr, Mr. Karl Howell    male  26.0
890                                Dooley, Mr. Patrick    male  32.0

[891 rows x 3 columns]

In [16]:
df.loc[0]

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                               22.0
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [17]:
df.loc[0:5]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

In [18]:
df[['Name','Sex','Age']].loc[10:20]

                                                 Name     Sex   Age
10                    Sandstrom, Miss. Marguerite Rut  female   4.0
11                           Bonnell, Miss. Elizabeth  female  58.0
12                     Saundercock, Mr. William Henry    male  20.0
13                        Andersson, Mr. Anders Johan    male  39.0
14               Vestrom, Miss. Hulda Amanda Adolfina  female  14.0
15                   Hewlett, Mrs. (Mary D Kingcome)   female  55.0
16                               Rice, Master. Eugene    male   2.0
17                       Williams, Mr. Charles Eugene    male   NaN
18  Vander Planke, Mrs. Julius (Emelia Maria Vande...  female  31.0
19                            Masselmani, Mrs. Fatima  female   NaN
20                               Fynney, Mr. Joseph J    male  35.0

In [19]:
df['Name'].loc[0]="Amit"

<ipython-input-19-3927f8f004cc>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Name'].loc[0]="Amit"

In [20]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,Amit,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
df['Name'].replace('','')

In [21]:
df.to_csv("/Users/admin/Movies/test/updatedata.csv",index=False)

In [ ]:
df=pd.read_excel()

In [ ]:
df.to_excel()

In [22]:
import openpyxl

In [24]:
wb=openpyxl.Workbook()
sheet=wb.active

sheet['A1']="Amit"

sheet.cell(row=1,column=2,value="Deepak")


wb.save("/Users/admin/Movies/test/data.xlsx")

In [25]:
wb=openpyxl.Workbook()
sheet=wb.active

data=[(101,"Amit",23),(102,"Deepak",56),
     (103,"Ram",90)]


r=c=1

for id,name,age  in data:
    sheet.cell(row=r,column=c,value=id)
    sheet.cell(row=r,column=c+1,value=name)
    sheet.cell(row=r,column=c+2,value=age)
    r=r+1

wb.save("/Users/admin/Movies/test/data.xlsx")

In [35]:
wb=openpyxl.load_workbook("/Users/admin/Movies/test/data.xlsx")
sheet=wb.active

#print(sheet['A1'].value)
#print(sheet.cell(row=1,column=2).value)
#for x in sheet['B']:
#    print(x.value)

#sheet['A:C']
#sheet[1]
sheet[1:3]

((<Cell 'Sheet'.A1>, <Cell 'Sheet'.B1>, <Cell 'Sheet'.C1>),
 (<Cell 'Sheet'.A2>, <Cell 'Sheet'.B2>, <Cell 'Sheet'.C2>),
 (<Cell 'Sheet'.A3>, <Cell 'Sheet'.B3>, <Cell 'Sheet'.C3>))

In [36]:
wb=openpyxl.load_workbook("/Users/admin/Movies/test/data.xlsx")
sheet=wb.active

sheet['A1']=123

wb.save("/Users/admin/Movies/test/data.xlsx")

In [45]:
wb=openpyxl.load_workbook("/Users/admin/Movies/test/data.xlsx")

#print(wb.sheetnames)
#wb.create_sheet("sales")
#sheet=wb['sales']
#print(sheet.title)
#sheet.title="order"
#sheet=wb['order']
#sheet['A1']="Hello"
#sheet=wb['order']
#wb.remove(sheet)

wb.save("/Users/admin/Movies/test/data.xlsx")

In [46]:
wb=openpyxl.load_workbook("/Users/admin/Movies/test/data.xlsx")

sheet=wb.active

sheet['C4']="=SUM(C1:C3)"

wb.save("/Users/admin/Movies/test/data.xlsx")

In [49]:
import json

In [50]:
people_string='''
{
 "people":[
       {
        "name": "John",
        "phone": "123-234-5678",
        "emails": ["Jhon@gmail.com","jhonsmith@gmail.com"],
        "has_license": false
        },
        
        {
        "name": "John Doe",
        "phone": "123-234-5678",
        "emails": ["Jhon23@gmail.com","jhonDoe@gmail.com"],
        "has_license": true
        }
      ]
   }'''

In [ ]:
load : file
loads : string
    
dump : file
dumps: string

In [51]:
data=json.loads(people_string)

In [52]:
type(data)

dict

In [53]:
data

{'people': [{'name': 'John',
   'phone': '123-234-5678',
   'emails': ['Jhon@gmail.com', 'jhonsmith@gmail.com'],
   'has_license': False},
  {'name': 'John Doe',
   'phone': '123-234-5678',
   'emails': ['Jhon23@gmail.com', 'jhonDoe@gmail.com'],
   'has_license': True}]}

In [55]:
with open("/Users/admin/Movies/test/data.json","w") as f:
    json.dump(data,f,indent=3)

In [56]:
with open("/Users/admin/Movies/test/data.json","r") as f:
    data1=json.load(f)

In [57]:
data1

{'people': [{'name': 'John',
   'phone': '123-234-5678',
   'emails': ['Jhon@gmail.com', 'jhonsmith@gmail.com'],
   'has_license': False},
  {'name': 'John Doe',
   'phone': '123-234-5678',
   'emails': ['Jhon23@gmail.com', 'jhonDoe@gmail.com'],
   'has_license': True}]}

In [58]:
st=json.dumps(data1,indent=4)

In [60]:
print(st)

{
    "people": [
        {
            "name": "John",
            "phone": "123-234-5678",
            "emails": [
                "Jhon@gmail.com",
                "jhonsmith@gmail.com"
            ],
            "has_license": false
        },
        {
            "name": "John Doe",
            "phone": "123-234-5678",
            "emails": [
                "Jhon23@gmail.com",
                "jhonDoe@gmail.com"
            ],
            "has_license": true
        }
    ]
}

In [61]:
import yaml

In [62]:
with open("/Users/admin/Downloads/ansible_configfile_AMIS.yml","r") as f:
    data=yaml.safe_load(f)

In [64]:
#data

In [65]:
data=[{'host':'192.168.0.1',
      'port':22,
      'user':'root',
      'password':'redhat'}]

In [66]:
with open("/Users/admin/Movies/test/dev.yml","w") as f:
    data=yaml.safe_dump(data,f)

In [67]:
with open("/Users/admin/Movies/test/dev.yml","r") as f:
    data=yaml.safe_load(f)

In [68]:
data

[{'host': '192.168.0.1', 'password': 'redhat', 'port': 22, 'user': 'root'}]

In [69]:
data[0]['pasword']="redhat@123"

In [70]:
data

[{'host': '192.168.0.1',
  'password': 'redhat',
  'port': 22,
  'user': 'root',
  'pasword': 'redhat@123'}]

In [71]:
with open("/Users/admin/Movies/test/prod.yml","w") as f:
    data=yaml.safe_dump(data,f)